#Задача 1. Вариант 5.
#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Анна Андреевна Горенко. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

#Dzhariashvili D. G.
#15.05.2016

print("Анна Андреевна Горенко более известна, как русская поэтесса Ахматова Анна Андреевна")

input("\n\nНажмите Enter для выхода.")