# Задача 5, Вариант 5

import random

sobor = random.randint(1, 7)

if (sobor) == 1:
print ("Благовещенский собор ")
elif (sobor) == 2:
print ("Архангельский собор ")
elif (sobor) == 3:
print ("Успенский собор")
elif (sobor) == 4:
print ("Собор «Двенадцати апостолов»")
elif (sobor) == 5:
print ("Церковь Ризположения")
elif (sobor) == 6:
print ("Колокольня Ивана Великого")

input ("\n\n...")