#Задача 2. Вариант 5.
#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Сюнь-цзы. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

#Dzhariashvili D.G.
#15.05.2016

print ("Война любит победу и не любит продолжительности. \nСюнь-цзы")

input ("Нажмите Enter, чтобы выйти")
